{
	"title": "Managing exam stress and anxiety",
	"slug": "managing-exam-stress",
	"excerpt": "Feeling stressed about exams is completely normal — but it doesn't have to take over. Learn practical strategies to manage anxiety, stay calm, and perform at your best.",
	"date": "2026-02-10",
	"lastUpdated": null,
	"published": true,
	"author": {
		"name": "Emily Clark",
		"avatarUrl": "/assets/authors/emily.jpg"
	},
	"tags": {
		"level": [
			"GCSE",
			"A-Level"
		],
		"subject": [],
		"theme": [
			"wellbeing"
		],
		"audience": [
			"Students",
			"Parents"
		]
	},
	"thumbnailUrl": "/assets/Thumbnail-variant-1.png",
	"illustrationUrl": "/assets/thumbnails/labrador.png",
	"thumbnailBg": "#fef9e7",
	"heroImageUrl": "/assets/Thumbnail-variant-1.png",
	"readingTime": 5,
	"sections": [
		{
			"type": "text",
			"content": "## Why exam stress happens\n\nIf you've ever felt your heart racing, your mind going blank, or a knot forming in your stomach before an exam — you're not alone. Exam stress is one of the most common experiences for students, and it affects almost everyone at some point.\n\nStress is actually your body's natural response to a challenge. When you face something important (like an exam), your brain releases hormones like cortisol and adrenaline to help you stay alert. In small doses, this can sharpen your focus. But when stress builds up over time or feels overwhelming, it can start to work against you.\n\nThe good news is that exam stress is manageable. With the right strategies, you can keep it in check and even use it to your advantage."
		},
		{
			"type": "alert",
			"variant": "info",
			"title": "Stress is not a sign of weakness",
			"content": "Feeling anxious about exams means you care about doing well. It's a normal human response — not something to be embarrassed about. Most high-performing students experience stress too."
		},
		{
			"type": "text",
			"content": "## Recognising the signs\n\nStress can show up in different ways, and it helps to know what to look out for — both in yourself and in others.\n\n### Physical symptoms\n\n- Headaches or stomach aches\n- Difficulty sleeping or sleeping too much\n- Feeling tired all the time\n- Tense muscles, especially in your shoulders and jaw\n- Loss of appetite or comfort eating\n\n### Mental and emotional symptoms\n\n- Difficulty concentrating or remembering things\n- Feeling overwhelmed or panicky\n- Irritability or mood swings\n- Negative self-talk (\"I'm going to fail\", \"I'm not smart enough\")\n- Avoiding revision altogether\n\nIf you're noticing several of these signs, it's a signal to take your wellbeing seriously — not to push harder."
		},
		{
			"type": "image",
			"src": "/assets/Thumbnail-variant-1.png",
			"alt": "Illustration showing the connection between physical and mental symptoms of exam stress",
			"caption": "Exam stress affects both your body and mind — learning to recognise the signs is the first step",
			"variant": "full"
		},
		{
			"type": "text",
			"content": "## Practical strategies that actually help\n\nThere's no single magic fix, but combining a few of these strategies can make a real difference. Pick the ones that feel right for you and build them into your daily routine."
		},
		{
			"type": "benefits",
			"items": [
				{
					"icon": "heart",
					"title": "Breathe and ground yourself",
					"description": "Try the 4-7-8 technique: breathe in for 4 seconds, hold for 7, breathe out for 8. Do this 3-4 times whenever anxiety spikes. It activates your body's calm-down response."
				},
				{
					"icon": "clock",
					"title": "Plan your time realistically",
					"description": "Create a revision timetable that includes rest days and breaks. Knowing what you'll study and when reduces the feeling of \"there's too much to do\"."
				},
				{
					"icon": "brain",
					"title": "Break it into smaller pieces",
					"description": "Don't try to revise an entire subject in one sitting. Break topics into 25-minute chunks using the Pomodoro technique, with 5-minute breaks in between."
				},
				{
					"icon": "shield",
					"title": "Protect your sleep",
					"description": "Your brain consolidates memories while you sleep. Aim for 8-10 hours a night and avoid screens for 30 minutes before bed. Sleep is revision's secret weapon."
				},
				{
					"icon": "zap",
					"title": "Move your body",
					"description": "Even a 15-minute walk or a few stretches can lower cortisol levels and boost your mood. Exercise is one of the most effective stress relievers there is."
				},
				{
					"icon": "users",
					"title": "Talk to someone",
					"description": "Don't bottle it up. Whether it's a parent, friend, teacher, or school counsellor — sharing how you feel takes weight off your shoulders and often leads to practical help."
				}
			]
		},
		{
			"type": "divider"
		},
		{
			"type": "text",
			"content": "## Building a daily wellbeing routine\n\nThe strategies above work best when they become habits rather than one-off fixes. Use the checklist below to build a simple daily routine during exam season."
		},
		{
			"type": "checklist",
			"title": "Daily wellbeing habits for exam season",
			"description": "Try to tick off as many of these as you can each day:",
			"items": [
				"Get 8-10 hours of sleep",
				"Eat a proper breakfast and stay hydrated",
				"Do at least 15 minutes of physical activity",
				"Take a 5-minute break every 25-30 minutes of revision",
				"Practise one breathing or mindfulness exercise",
				"Spend time away from screens before bed",
				"Talk to someone about how you're feeling",
				"Do one thing you enjoy that isn't revision"
			]
		},
		{
			"type": "alert",
			"variant": "tip",
			"title": "The 3-3-3 grounding technique",
			"content": "If you feel a wave of panic, try this: name 3 things you can see, 3 things you can hear, and move 3 parts of your body. This simple exercise pulls your attention back to the present moment and interrupts the anxiety spiral."
		},
		{
			"type": "text",
			"content": "## What to do on exam day\n\nExam-day nerves are completely normal. Here are some quick things you can do on the morning of an exam:\n\n1. **Wake up with plenty of time** — rushing increases stress\n2. **Eat a balanced breakfast** — your brain needs fuel (porridge, toast, or eggs are great options)\n3. **Avoid last-minute cramming** — glance at key points if it helps, but don't try to learn new material\n4. **Arrive early** — give yourself time to settle in\n5. **Use your breathing technique** — a few slow breaths before the exam starts can lower your heart rate\n\n> \"You've already done the work. The exam is just a chance to show what you know.\"\n\nRemember, if your mind goes blank during the exam, don't panic. Move on to a question you can answer, and come back to the tricky one later. Your memory often returns once the initial anxiety passes."
		},
		{
			"type": "image",
			"src": "/assets/Thumbnail-variant-2.png",
			"alt": "Student taking a calming breath before an exam",
			"caption": "A few deep breaths before the exam starts can make a real difference to how you feel",
			"variant": "medium"
		},
		{
			"type": "accordion",
			"title": "Common questions about exam stress",
			"items": [
				{
					"title": "Is some stress actually good for you?",
					"content": "Yes — in small amounts. A moderate level of stress (sometimes called 'eustress') can improve focus, motivation, and performance. The problems start when stress becomes constant or overwhelming. The goal isn't to eliminate stress entirely, but to keep it at a level where it helps rather than hinders you."
				},
				{
					"title": "What if I feel like I can't cope at all?",
					"content": "If your stress feels unmanageable — if you can't sleep, can't eat, or feel hopeless — please talk to a trusted adult. Your school may have a counsellor, and your GP can also help. Organisations like Childline (0800 1111) and Young Minds offer free, confidential support. Asking for help is a sign of strength, not weakness."
				},
				{
					"title": "My parents are putting pressure on me. What should I do?",
					"content": "Parents usually add pressure because they care and want the best for you — but that doesn't make it easier to deal with. Try having an honest conversation about how you're feeling. Explain that the pressure is making things harder, not better. Often parents don't realise the effect their words are having. If talking directly feels difficult, writing a letter or asking a teacher to help mediate can work too."
				},
				{
					"title": "Does revision music actually help with stress?",
					"content": "It depends on the person and the type of music. Instrumental music or lo-fi beats can help some students feel calmer and more focused. Music with lyrics tends to be more distracting. Experiment to see what works for you — if you find yourself singing along instead of revising, it's probably not helping!"
				},
				{
					"title": "How do I stop comparing myself to others?",
					"content": "Comparison is one of the biggest stress amplifiers. Remember that everyone learns at a different pace, and you only see other people's highlight reels, not their struggles. Focus on your own progress — are you better prepared than you were last week? That's what matters. Limiting social media during exam season can also help reduce comparison."
				}
			]
		},
		{
			"type": "divider"
		},
		{
			"type": "alert",
			"variant": "warning",
			"title": "When to seek professional help",
			"content": "If stress or anxiety is significantly affecting your daily life — you can't sleep for days, you're having panic attacks, or you feel unable to function — please reach out to a professional. Speak to your GP, school counsellor, or contact Young Minds (youngminds.org.uk) or Childline (0800 1111). You don't have to go through this alone."
		},
		{
			"type": "cta",
			"variant": "large",
			"title": "Revise with less stress",
			"description": "Cognito's free videos and quizzes break topics into bite-sized pieces — so revision feels manageable, not overwhelming.",
			"buttonText": "Start revising for free",
			"buttonUrl": "https://cognito.org/signup"
		},
		{
			"type": "divider"
		},
		{
			"type": "related-content",
			"title": "Related articles",
			"slugs": [
				"how-to-revise-effectively-gcses",
				"top-10-revision-mistakes",
				"solve-quadratic-equations"
			]
		}
	]
}
